resume.org
#+TITLE:George Kontsevich
#+HTML_DOCTYPE: html5
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../web/worg.css" />
#+HTML_HEAD_EXTRA: <link rel="shortcut icon" href="../web/panda.svg" type="image/x-icon">
#+OPTIONS: html-style:nil
#+OPTIONS: num:nil
#+OPTIONS: html-postamble:nil
#+OPTIONS: toc:nil 
#+OPTIONS: num:nil
#+OPTIONS: html-scripts:nil

=last updated 2022-01-10=

/BA Physics UCSB/ \\
/BS Computer Science UCSB/ \\
*** XRF Core software
#+BEGIN_QUOTE 
    Wrote a program for the ITRAX XRF Scanner: [[https://geokon-gh.github.io/corascope/][Corascope]]
        - GUI Program in Clojure (cljfx/JavaFX)
        - XRF Data manipulation for reassembling sequentialy segments into a stratigraphically correct sequence.
    The final software was published: https://www.sciencedirect.com/science/article/pii/S0098300421001977 \\
    And is available online: https://geokon-gh.github.io/corascope/
#+END_QUOTE
[[http://web.gl.ntu.edu.tw/ENG/index.php/about-us/faculty/professors/item/54-associate-professor-ludvig-loewemark][Geoscience - NTU]] /Taipei, Taiwan/
2015-2019

*** C++ Optimization + Build Systems
#+BEGIN_QUOTE 
    Worked on a large C++ codebase for palm biometrics identification
        - Using profiling tools to find performance issue (valgrind/perf/gprof)
        - Optimizing code for performance (cache locality issues, vectorization, etc.)
        - Rewriting the build tools using Hunter/CMake
        - Maintaining builds of binaries for virtually all platform (android/ios/arm/windows/macos/linux)
#+END_QUOTE
[[https://www.redrockbiometrics.com][RedRock Biometrics]] /Chengdu, Sichuan/
2015-2019

*** Radar control systems
#+BEGIN_QUOTE 
    Worked on a system of decentralized radar coordination for a small employee owned defense contractor - Toyon Research Corporation. The first half year I worked on a contract for a system coordinating shipborn radars for tracking aircraft. The remaining two years was on a system for tracking ballistic missiles through all stages of flight and to assist in anti-ballistic interception. Highlights:

        - Working on and maintaining a large C++(11) codebase
        - Designing a radar system for both physical accuracy as well as high performance (near real-time)
        - Designing a (boosted) ballistic missile simulation including multi-stage separation.
        - A full statistical evaluation of the mathematical correctness of the optimization algorithm.
#+END_QUOTE

[[https://www.toyon.com][Toyon Research Corporation]], /Santa Barbara CA/
2012-2015
*** Quasioptical research
#+BEGIN_QUOTE
*internship* - Researching the transmission of terahertz radiation through ITOcoated touch screens for Synaptics Inc. on behalf of the ITST at the UCSB. 
#+END_QUOTE
[[https://www.synaptics.com][Synaptics]] UCSB
2011
*** Nonlinear systems and simulation
#+BEGIN_QUOTE
*internship* - Researching the theoretical possibilities presented by stochastic resonance in non-linear systems for filter design for two months at Hitachi Ltd., Japan. Designing and running simulations in MATLAB using SIMULINK. (Note: due to an NDA, I can’t share the details of this work).
#+END_QUOTE
[[https://www.hitachi.com][Hitachi]] /Yokohama, Japan/
2010
*** Research assistant
#+BEGIN_QUOTE
*internship* - Part of a team at the ITST in the Electron Pulse Resonance (EPR) lab setting up and upgrading Free Electron Laser (FEL)
#+END_QUOTE

[[https://www.itst.ucsb.edu][ITST]], UCSB
2010
*** Research in photonic crystals
#+BEGIN_QUOTE
*internship* - Electromagnetic simulations for quasioptical crystal patterns optimization
#+END_QUOTE

[[https://www.itst.ucsb.edu][ITST]], UCSB
2009
*** Data Analyst - Neuroscience
#+BEGIN_QUOTE
*internship* - Data analysis in R of the retinal neural activity of mice at the Institute of Neuroscience (ION) at the University of Newcastle, UK. Independent
#+END_QUOTE

[[https://www.ncl.ac.uk/ion][ION University of Newcastle]] /Newcastle, UK/
2009
*** Data Analyst – HTS cancer research
#+BEGIN_QUOTE
*internship* - Worked with a cancer research team on a large-scale statistical analysis of data on cancer inhibition using R and Bioconductor at the André Lwoff Institute (CNRS Villejuif, France)
#+END_QUOTE

[[https://www.institut-lwoff.fr][CNRS]] /Paris, France/
2008
** Languages:

*Fluent* English, French, Russian

*Basic* Spanish, Chinese 
