resume.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-01-10 Mon 17:22 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>George Kontsevich</title>
<meta name="generator" content="Org mode">
<meta name="author" content="George Kontsevich">
<link rel="stylesheet" type="text/css" href="../web/worg.css" />
<link rel="shortcut icon" href="../web/panda.svg" type="image/x-icon">
</head>
<body>
<div id="content">
<h1 class="title">George Kontsevich</h1>
<p>
<code>last updated 2022-01-10</code>
</p>

<p>
<i>BA Physics UCSB</i> <br>
<i>BS Computer Science UCSB</i> <br>
</p>
<div id="outline-container-org0ddecf7" class="outline-3">
<h3 id="org0ddecf7">XRF Core software</h3>
<div class="outline-text-3" id="text-org0ddecf7">
<blockquote>
<p>
Wrote a program for the ITRAX XRF Scanner: <a href="https://geokon-gh.github.io/corascope/">Corascope</a>
</p>
<ul class="org-ul">
<li>GUI Program in Clojure (cljfx/JavaFX)</li>
<li>XRF Data manipulation for reassembling sequentialy segments into a stratigraphically correct sequence.</li>
</ul>
<p>
The final software was published: <a href="https://www.sciencedirect.com/science/article/pii/S0098300421001977">https://www.sciencedirect.com/science/article/pii/S0098300421001977</a> <br>
And is available online: <a href="https://geokon-gh.github.io/corascope/">https://geokon-gh.github.io/corascope/</a>
</p>
</blockquote>
<p>
<a href="http://web.gl.ntu.edu.tw/ENG/index.php/about-us/faculty/professors/item/54-associate-professor-ludvig-loewemark">Geoscience - NTU</a> <i>Taipei, Taiwan</i>
2015-2019
</p>
</div>
</div>

<div id="outline-container-org142c32b" class="outline-3">
<h3 id="org142c32b">C++ Optimization + Build Systems</h3>
<div class="outline-text-3" id="text-org142c32b">
<blockquote>
<p>
Worked on a large C++ codebase for palm biometrics identification
</p>
<ul class="org-ul">
<li>Using profiling tools to find performance issue (valgrind/perf/gprof)</li>
<li>Optimizing code for performance (cache locality issues, vectorization, etc.)</li>
<li>Rewriting the build tools using Hunter/CMake</li>
<li>Maintaining builds of binaries for virtually all platform (android/ios/arm/windows/macos/linux)</li>
</ul>
</blockquote>
<p>
<a href="https://www.redrockbiometrics.com">RedRock Biometrics</a> <i>Chengdu, Sichuan</i>
2015-2019
</p>
</div>
</div>

<div id="outline-container-org8428c03" class="outline-3">
<h3 id="org8428c03">Radar control systems</h3>
<div class="outline-text-3" id="text-org8428c03">
<blockquote>
<p>
Worked on a system of decentralized radar coordination for a small employee owned defense contractor - Toyon Research Corporation. The first half year I worked on a contract for a system coordinating shipborn radars for tracking aircraft. The remaining two years was on a system for tracking ballistic missiles through all stages of flight and to assist in anti-ballistic interception. Highlights:
</p>

<ul class="org-ul">
<li>Working on and maintaining a large C++(11) codebase</li>
<li>Designing a radar system for both physical accuracy as well as high performance (near real-time)</li>
<li>Designing a (boosted) ballistic missile simulation including multi-stage separation.</li>
<li>A full statistical evaluation of the mathematical correctness of the optimization algorithm.</li>
</ul>
</blockquote>

<p>
<a href="https://www.toyon.com">Toyon Research Corporation</a>, <i>Santa Barbara CA</i>
2012-2015
</p>
</div>
</div>
<div id="outline-container-org6b18954" class="outline-3">
<h3 id="org6b18954">Quasioptical research</h3>
<div class="outline-text-3" id="text-org6b18954">
<blockquote>
<p>
<b>internship</b> - Researching the transmission of terahertz radiation through ITOcoated touch screens for Synaptics Inc. on behalf of the ITST at the UCSB. 
</p>
</blockquote>
<p>
<a href="https://www.synaptics.com">Synaptics</a> UCSB
2011
</p>
</div>
</div>
<div id="outline-container-org02dc653" class="outline-3">
<h3 id="org02dc653">Nonlinear systems and simulation</h3>
<div class="outline-text-3" id="text-org02dc653">
<blockquote>
<p>
<b>internship</b> - Researching the theoretical possibilities presented by stochastic resonance in non-linear systems for filter design for two months at Hitachi Ltd., Japan. Designing and running simulations in MATLAB using SIMULINK. (Note: due to an NDA, I can’t share the details of this work).
</p>
</blockquote>
<p>
<a href="https://www.hitachi.com">Hitachi</a> <i>Yokohama, Japan</i>
2010
</p>
</div>
</div>
<div id="outline-container-org305151a" class="outline-3">
<h3 id="org305151a">Research assistant</h3>
<div class="outline-text-3" id="text-org305151a">
<blockquote>
<p>
<b>internship</b> - Part of a team at the ITST in the Electron Pulse Resonance (EPR) lab setting up and upgrading Free Electron Laser (FEL)
</p>
</blockquote>

<p>
<a href="https://www.itst.ucsb.edu">ITST</a>, UCSB
2010
</p>
</div>
</div>
<div id="outline-container-org15cdba7" class="outline-3">
<h3 id="org15cdba7">Research in photonic crystals</h3>
<div class="outline-text-3" id="text-org15cdba7">
<blockquote>
<p>
<b>internship</b> - Electromagnetic simulations for quasioptical crystal patterns optimization
</p>
</blockquote>

<p>
<a href="https://www.itst.ucsb.edu">ITST</a>, UCSB
2009
</p>
</div>
</div>
<div id="outline-container-org6a11f2b" class="outline-3">
<h3 id="org6a11f2b">Data Analyst - Neuroscience</h3>
<div class="outline-text-3" id="text-org6a11f2b">
<blockquote>
<p>
<b>internship</b> - Data analysis in R of the retinal neural activity of mice at the Institute of Neuroscience (ION) at the University of Newcastle, UK. Independent
</p>
</blockquote>

<p>
<a href="https://www.ncl.ac.uk/ion">ION University of Newcastle</a> <i>Newcastle, UK</i>
2009
</p>
</div>
</div>
<div id="outline-container-orga12c77b" class="outline-3">
<h3 id="orga12c77b">Data Analyst – HTS cancer research</h3>
<div class="outline-text-3" id="text-orga12c77b">
<blockquote>
<p>
<b>internship</b> - Worked with a cancer research team on a large-scale statistical analysis of data on cancer inhibition using R and Bioconductor at the André Lwoff Institute (CNRS Villejuif, France)
</p>
</blockquote>

<p>
<a href="https://www.institut-lwoff.fr">CNRS</a> <i>Paris, France</i>
2008
</p>
</div>
</div>
<div id="outline-container-orgcc92a47" class="outline-2">
<h2 id="orgcc92a47">Languages:</h2>
<div class="outline-text-2" id="text-orgcc92a47">
<p>
<b>Fluent</b> English, French, Russian
</p>

<p>
<b>Basic</b> Spanish, Chinese 
</p>
</div>
</div>
</div>
</body>
</html>
